cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'homebrew/services'

# Tools
brew 'zsh'
brew 'autojump'      # A scd command that learns - easily navigate directories from the command line
brew 'coreutils'     # Basic file, shell and text manipulation utilities
brew 'neovim'
brew 'nvm'
brew 'readline'      # Edit command lines as they are typed in
brew 'tree'          # Hierarchical view of file system
brew 'wget'          # Non-interactive network retriever
brew 'yarn'
brew 'mas'           # Command line interface for the Mac App Store

# brew 'redis'
# brew 'rbenv'         # Ruby version manager
# brew 'ruby-build'    # List of ruby versions for rbenv
# brew 'go'
# brew 'imagemagick'   # Command-line tool for image manipulation

# tap 'ivandokov/homebrew-contrib'
# brew 'phockup'     # Media sorting tool to organize photos and videos from your camera in folders by year, month and day

# Apps
cask 'alfred'
cask 'authy'
cask 'docker'
cask 'dropbox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'        # iTerm2 terminal
cask 'slack'
cask 'spotify'
cask 'standard-notes'
cask "sublime-text"
cask 'postman'
cask 'nordvpn'
# cask 'atom'
# cask 'ngrok'         # ngrok for exposing local ports to the outside world

# cask 'vlc'
# cask 'raspberry-pi-imager'
# cask 'lastpass'
# cask 'firefox'
# cask 'whatsapp'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
